# IFCTransformSetter Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCTransformSetter Methods
IFCTransformSetter Class See Also
---
The IFCTransformSetter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates a new instance of a transform setter. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Initialize | Initializes the transformation in the transform setter. |
| InitializeFromBoundingBox |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace